{
	"talks":[
		{
			"event":{
				"name":"Hodge Club",
				"location":"Edinburgh University",
				"date":"2022-04-22",
				"url":"https://hodge.maths.ed.ac.uk/tiki/Hodge+Club+-+Archived#Semester_2"
			},
			"title":"Conway's approach to symmetries",
			"abstract":"When I first saw the classification of wallpaper groups, as I'm sure it was the same with many others, it was a very algebraic approach. For example considering the translation subgroup, the point group, and ways they can fit together. This past semester I had the opportunity to tutor for Toby Bailey's course \"Symmetry and Geometry\", which is based on material from a book co-authored by one of his past lecturers John Conway titled \"The Symmetries of things\". The approach in this text is, instead of considering the groups themselves, to consider the space (which has the symmetries) quotiented by the group of symmetries giving so called orbifolds. This method generalises well to spherical and hyperbolic symmetry and gives clean picturesque ways of classifying certain types of tilings. This talk is a 50 minute picturesque summary and advert for the topics in this area.",
			"type":"slides",
			"artifacts":"https://git.ecdf.ed.ac.uk/personal-latex-documents/presentations/symmetries-hodge-club"
		},
		{
			"event":{
				"name":"Hodge Club",
				"location":"Edinburgh University",
				"date":"2023-03-24",
				"url":"https://hodge.maths.ed.ac.uk/tiki/Hodge+Club"
			},
			"title":"Bridgeland Stabilities and Finding Walls",
			"abstract":"As many are aware, quite a few of us in the school are concerned with the business of stability conditions on sheaves. If you’ve talked to these people before, you very quickly realise that this is actually short for “stability conditions on the derived category of coherent sheaves”. In this talk I introduce this topic, particularly, the explicit stability conditions constructed by Bridgeland for K3 surfaces. But also how they relate to the more classical Mumford and Gieseker stabilities (which do not involve the derived). Later on, some stabilities on threefolds too. Along the way we will have a look at the notion of walls and why we want to find them. This will also expose the benefit of a couple of different viewpoints to find restrictions on the set of possible walls, some numeric, but also the geometry of some characteristic curves on the space of stability conditions.",
			"type":"slides",
			"artifacts":"https://git.ecdf.ed.ac.uk/personal-latex-documents/presentations/stabilities-hodge-club"
		},
		{
			"event":{
				"name":"GEARS",
				"location":"Glasgow University",
				"date":"2022-10-25",
				"url":"https://sites.google.com/view/gears-seminar/2022-23"
			},
			"title":"From Fourier to Fourier-Mukai",
			"abstract":"When you look at the definition for the Fourier-Mukai Transform, it's hard to see what this has to do with integral transforms, let alone the one in its name. Yet, this analogy was obvious to Shigeru Mukai, who first introduced it in the 80s as \"a Fourier functor\". During this talk I will present the Fourier Transform, and the Fourier-Mukai transform, concentrating on the similarities and how they are used for the same purpose. Then, finally, a peek at what role this plays in finding walls for Bridgeland stability conditions.",
			"type":"blackboard"
		},
		{}
	],
	"posters":[
		{
			"event":{
				"name":"Conference: Derived Categories, Moduli Spaces, and Counting Invariants",
				"location":"Imperial College London",
				"date":"2023-07-04",
				"url":"https://sites.google.com/view/gears-seminar/2022-23"
			},
			"title":"Tighter bounds on ranks of tilt semistabilizers – narrowing down on possibilities quicker",
			"abstract":"When trying to narrow down the possibilities for the locations of tilt walls, the typical strategy is to find potential semistabilizers who’s Chern characters satisfy a set of inequalities which would be satisfied by genuine ones (including Bogomolov-Gieseker). In 2020, Benjamin Schmidt published a program to compute the possibilities, however the running time suffered from a conservative estimate for a bound on the ranks of tilt semistabilizers. The work I want to present is a set of refinements on this bound, one in the form of a pragmatic formula to calculate by hand which can be as small as a quarter of the original bound. As well as more complicated formulae with extra parameters which are better suited in the context of a newer computer program. This newer program gives instantaneous results in certain examples where the original takes over an hour, and can easily be tried from your browser at https://pseudowalls.gitlab.io/webapp/tilt.sycamore/."
		}
	]
}
